src/Catalogs/АлгоритмыПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>АлгоритмыПроцессов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СообщениеПриНевыполнении</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Условие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛокальныеИменованныеКонстанты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ВозвратыОтПокупателяКлиент/Ext/Module.bsl
#Область Команды

Процедура ВыполнитьКоманду( пФорма, Знач пКоманда, Знач пЗадачи = Неопределено ) Экспорт
	
	выбраннаяКоманда = ПолучитьКомандуПроцессаДляВыполнения( пФорма, пКоманда );
	
	Если выбраннаяКоманда = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	данныеКоманды = НайтиСтрокуСКомандойПоКомандеПроцесса( пФорма, выбраннаяКоманда );
	ИК = Справочники.ИменованныеКонстантыПроцессов.СтруктураКонстант();
	
	успешно = Истина;
	
	Если данныеКоманды.НаКлиенте Тогда
		
		МассивОбработчиков = ВозвратыОтПокупателяВызовСервера.ПолучитьМассивОбработчиковКоманды(выбраннаяКоманда);
		Для каждого Алгоритм Из МассивОбработчиков Цикл
			
			лИК = Справочники.АлгоритмыПроцессов.СтруктураКонстантАлгоритма(Алгоритм);
			
			попытка
				Выполнить(Алгоритм.Алгоритм);
			Исключение
				ТекстОшибки = "Ошибка выполнения команды: "+выбраннаяКоманда.Наименование+", алгоритм: "+Алгоритм+", описание ошибки: "+ОписаниеОшибки();
				Сообщить(ТекстОшибки);
				ВызватьИсключение ТекстОшибки;
			КонецПопытки;
			
		КонецЦикла;
		
	Иначе
		
		успешно = пФорма.ВыполнитьКомандуПроцесса( выбраннаяКоманда );
		
	КонецЕсли;
	
	пФорма.Модифицированность = Ложь;
	
КонецПроцедуры

Функция ПолучитьКомандуПроцессаДляВыполнения( пФорма, пКоманда )
	
	выбраннаяКоманда = Неопределено;
	
	Если пКоманда.Имя = "ВыполнитьКоманду" Тогда
		//
		//Отбор = Новый Структура( "Ссылка" , МассивДоступныхКомандПроцесса( пФорма ) );
		//
		//ПараметрыФормы = Новый Структура( "Отбор" , Отбор );
		//
		//выбраннаяКоманда = ОткрытьФормуМодально( "Справочник.КомандыПроцессов.ФормаВыбора" , ПараметрыФормы , пФорма );
		
	Иначе
		
		выбраннаяКоманда = НайтиСтрокуСКомандойПоКомандеФормы( пФорма, пКоманда ).Команда;
		
	КонецЕсли;
	
	Возврат выбраннаяКоманда;
	
КонецФункции

Функция МассивДоступныхКомандПроцесса( пФорма )
	
	массивКоманд = Новый Массив;
	
	Для каждого цСтрока Из пФорма.ТаблицаКоманд Цикл
		
		массивКоманд.Добавить( цСтрока.командаПроцесса );
		
	КонецЦикла;
	
	Возврат массивКоманд;
	
КонецФункции	//МассивДоступныхКомандПроцесса

Функция НайтиСтрокуСКомандойПоКомандеФормы( пФорма, пКоманда )
	
	Возврат НайтиСтрокуСКомандой( пФорма, Новый Структура( "имяКомандыФормы" , пКоманда.Имя ) );
	
КонецФункции

Функция НайтиСтрокуСКомандойПоКомандеПроцесса( пФорма, пКомандаПроцесса )
	
	Возврат НайтиСтрокуСКомандой( пФорма, Новый Структура( "Команда" , пКомандаПроцесса ) );
	
КонецФункции

Функция НайтиСтрокуСКомандой( пФорма, пСтруктПоиска )
	
	найденныеСтроки = пФорма.ТаблицаКоманд.НайтиСтроки( пСтруктПоиска );
	
	Если найденныеСтроки.Количество() > 0 Тогда
		
		найденнаяСтрока = найденныеСтроки[0];
		
	Иначе
		
		текстСообщения = НСтр( "ru='Описание команды процесса """+пСтруктПоиска.имяКомандыФормы+""" не найдено'" );
		
		ВызватьИсключение текстСообщения;
		
	КонецЕсли;
	
	Возврат найденнаяСтрока;
	
КонецФункции



#КонецОбласти
